<details>
<summary>Execution result of "run --all --non-interactive --summary-per-unit --log-level stderr --log-format bare -- plan" in "IaC/production/homelab"</summary>

```terraform

Initializing the backend...

Initializing the backend...

Initializing the backend...

Initializing the backend...

Initializing the backend...

Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Reusing previous version of hashicorp/helm from the dependency lock file

Initializing provider plugins...
- Reusing previous version of hashicorp/helm from the dependency lock file

Initializing provider plugins...
- Reusing previous version of hashicorp/helm from the dependency lock file

Initializing provider plugins...
- Reusing previous version of hashicorp/kubernetes from the dependency lock file

Initializing provider plugins...
- Reusing previous version of hashicorp/helm from the dependency lock file
- Reusing previous version of hashicorp/kubernetes from the dependency lock file
- Reusing previous version of hashicorp/kubernetes from the dependency lock file
- Reusing previous version of hashicorp/kubernetes from the dependency lock file
- Reusing previous version of hashicorp/helm from the dependency lock file
- Installing hashicorp/helm v3.1.1 to the shared cache directory...
- Installing hashicorp/helm v3.1.1 to the shared cache directory...
- Installing hashicorp/helm v3.1.1 to the shared cache directory...
- Installing hashicorp/helm v3.1.1 to the shared cache directory...
- Installing hashicorp/kubernetes v3.0.1 to the shared cache directory...
- Installed hashicorp/kubernetes v3.0.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/kubernetes v3.0.1 from the shared cache directory
- Installed hashicorp/helm v3.1.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/helm v3.1.1 from the shared cache directory
- Installing hashicorp/helm v3.1.1 to the shared cache directory...
- Installing hashicorp/kubernetes v3.0.1 to the shared cache directory...
- Installed hashicorp/helm v3.1.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/helm v3.1.1 from the shared cache directory
- Installing hashicorp/kubernetes v3.0.1 to the shared cache directory...
- Installed hashicorp/kubernetes v3.0.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/kubernetes v3.0.1 from the shared cache directory

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

OpenTofu has been successfully initialized!
kubernetes_namespace_v1.metallb_system: Refreshing state... [id=metallb-system]
- Installed hashicorp/helm v3.1.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/helm v3.1.1 from the shared cache directory
- Installing hashicorp/kubernetes v3.0.1 to the shared cache directory...
- Installed hashicorp/kubernetes v3.0.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/kubernetes v3.0.1 from the shared cache directory

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

OpenTofu has been successfully initialized!
helm_release.metallb: Refreshing state... [id=metallb]
kubernetes_namespace_v1.longhorn_system: Refreshing state... [id=longhorn-system]
- Installed hashicorp/helm v3.1.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/helm v3.1.1 from the shared cache directory

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

OpenTofu has been successfully initialized!
- Installed hashicorp/kubernetes v3.0.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/kubernetes v3.0.1 from the shared cache directory

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

OpenTofu has been successfully initialized!
helm_release.longhorn: Refreshing state... [id=longhorn]
helm_release.nfs_database: Refreshing state... [id=nfs-subdir-external-provisioner-database]
helm_release.nfs_media: Refreshing state... [id=nfs-subdir-external-provisioner-media]
helm_release.nfs_subdir_external_provisioner: Refreshing state... [id=nfs-subdir-external-provisioner]
kubernetes_namespace_v1.metrics: Refreshing state... [id=metrics-server]
- Installed hashicorp/helm v3.1.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/helm v3.1.1 from the shared cache directory

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

OpenTofu has been successfully initialized!
helm_release.release: Refreshing state... [id=metrics-server]

No changes. Your infrastructure matches the configuration.

OpenTofu has compared your real infrastructure against your configuration and
found no differences, so no changes are needed.

No changes. Your infrastructure matches the configuration.

OpenTofu has compared your real infrastructure against your configuration and
found no differences, so no changes are needed.
kubernetes_namespace_v1.external_secrets: Refreshing state... [id=external-secrets]
kubernetes_secret_v1.name: Refreshing state... [id=external-secrets/aws-ssm-secret]
helm_release.release: Refreshing state... [id=external-secrets]

No changes. Your infrastructure matches the configuration.

OpenTofu has compared your real infrastructure against your configuration and
found no differences, so no changes are needed.
kubernetes_manifest.external_secrets_secret_store: Refreshing state...
kubernetes_manifest.ip_address_pool: Refreshing state...
kubernetes_manifest.l2_advertisement: Refreshing state...

No changes. Your infrastructure matches the configuration.

OpenTofu has compared your real infrastructure against your configuration and
found no differences, so no changes are needed.

Initializing the backend...

Initializing the backend...

Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Reusing previous version of hashicorp/helm from the dependency lock file

Initializing provider plugins...
- Reusing previous version of hashicorp/kubernetes from the dependency lock file
- Reusing previous version of hashicorp/kubernetes from the dependency lock file
- Reusing previous version of hashicorp/helm from the dependency lock file
- Reusing previous version of hashicorp/aws from the dependency lock file
- Installing hashicorp/helm v3.1.1 to the shared cache directory...
- Installing hashicorp/helm v3.1.1 to the shared cache directory...

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place (current -> planned)

OpenTofu will perform the following actions:

  # helm_release.release will be updated in-place
  ~ resource "helm_release" "release" {
      ~ id                         = "external-secrets" -> (known after apply)
      ~ metadata                   = {
          ~ app_version    = "v1.3.1" -> (known after apply)
          ~ chart          = "external-secrets" -> (known after apply)
          ~ first_deployed = 1766553801 -> (known after apply)
          ~ last_deployed  = 1769404179 -> (known after apply)
          ~ name           = "external-secrets" -> (known after apply)
          ~ namespace      = "external-secrets" -> (known after apply)
          ~ notes          = <<-EOT
                external-secrets has been deployed successfully in namespace external-secrets!
                
                In order to begin using ExternalSecrets, you will need to set up a SecretStore
                or ClusterSecretStore resource (for example, by creating a 'vault' SecretStore).
                
                More information on the different types of SecretStores and how to configure them
                can be found in our Github: https://github.com/external-secrets/external-secrets
            EOT -> (known after apply)
          ~ revision       = 4 -> (known after apply)
          ~ values         = jsonencode({}) -> (known after apply)
          ~ version        = "1.3.1" -> (known after apply)
        } -> (known after apply)
        name                       = "external-secrets"
      ~ set_wo                     = (write-only attribute)
      ~ version                    = "1.3.1" -> "1.3.2"
        # (27 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
- Installed hashicorp/helm v3.1.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/helm v3.1.1 from the shared cache directory
- Installing hashicorp/kubernetes v3.0.1 to the shared cache directory...
- Installed hashicorp/helm v3.1.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/helm v3.1.1 from the shared cache directory
- Installed hashicorp/kubernetes v3.0.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/kubernetes v3.0.1 from the shared cache directory

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

OpenTofu has been successfully initialized!
- Installing hashicorp/aws v6.27.0 to the shared cache directory...
kubernetes_namespace_v1.traefik: Refreshing state... [id=traefik]
helm_release.traefik: Refreshing state... [id=traefik]
kubernetes_manifest.traefik_certificate: Refreshing state...

No changes. Your infrastructure matches the configuration.

OpenTofu has compared your real infrastructure against your configuration and
found no differences, so no changes are needed.
- Installed hashicorp/aws v6.27.0 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/aws v6.27.0 from the shared cache directory
- Installing hashicorp/kubernetes v3.0.1 to the shared cache directory...
- Installed hashicorp/kubernetes v3.0.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/kubernetes v3.0.1 from the shared cache directory

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

OpenTofu has been successfully initialized!
kubernetes_namespace_v1.argocd: Refreshing state... [id=argocd]
helm_release.release: Refreshing state... [id=argocd]
helm_release.argocd_image_updater: Refreshing state... [id=argocd-image-updater]
aws_ssm_parameter.argocd["client_secret"]: Refreshing state... [id=/homelab/argocd/client_secret]
kubernetes_manifest.argocd_certificate: Refreshing state...
kubernetes_manifest.argocd_secret: Refreshing state...

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place (current -> planned)

OpenTofu will perform the following actions:

  # helm_release.argocd_image_updater will be updated in-place
  ~ resource "helm_release" "argocd_image_updater" {
      ~ id                         = "argocd-image-updater" -> (known after apply)
      ~ metadata                   = {
          ~ app_version    = "v1.0.2" -> (known after apply)
          ~ chart          = "argocd-image-updater" -> (known after apply)
          ~ first_deployed = 1754265078 -> (known after apply)
          ~ last_deployed  = 1767400104 -> (known after apply)
          ~ name           = "argocd-image-updater" -> (known after apply)
          ~ namespace      = "argocd" -> (known after apply)
          ~ notes          = "" -> (known after apply)
          ~ revision       = 16 -> (known after apply)
          ~ values         = jsonencode(
                {
                  - extraArgs = [
                      - "--interval",
                      - "2m",
                    ]
                }
            ) -> (known after apply)
          ~ version        = "1.0.4" -> (known after apply)
        } -> (known after apply)
        name                       = "argocd-image-updater"
      ~ set_wo                     = (write-only attribute)
      ~ version                    = "1.0.4" -> "1.1.0"
        # (27 unchanged attributes hidden)
    }

  # helm_release.release will be updated in-place
  ~ resource "helm_release" "release" {
      ~ id                         = "argocd" -> (known after apply)
      ~ metadata                   = {
          ~ app_version    = "v3.2.6" -> (known after apply)
          ~ chart          = "argo-cd" -> (known after apply)
          ~ first_deployed = 1747803855 -> (known after apply)
          ~ last_deployed  = 1769404241 -> (known after apply)
          ~ name           = "argocd" -> (known after apply)
          ~ namespace      = "argocd" -> (known after apply)
          ~ notes          = <<-EOT
                In order to access the server UI you have the following options:
                
                1. kubectl port-forward service/argocd-server -n argocd 8080:443
                
                    and then open the browser on http://localhost:8080 and accept the certificate
                
                2. enable ingress in the values file `server.ingress.enabled` and either
                      - Add the annotation for ssl passthrough: https://argo-cd.readthedocs.io/en/stable/operator-manual/ingress/#option-1-ssl-passthrough
                      - Set the `configs.params."server.insecure"` in the values file and terminate SSL at your ingress: https://argo-cd.readthedocs.io/en/stable/operator-manual/ingress/#option-2-multiple-ingress-objects-and-hosts
                
                
                After reaching the UI the first time you can login with username: admin and the random password generated during the installation. You can find the password by running:
                
                kubectl -n argocd get secret argocd-initial-admin-secret -o jsonpath="{.data.password}" | base64 -d
                
                (You should delete the initial secret afterwards as suggested by the Getting Started Guide: https://argo-cd.readthedocs.io/en/stable/getting_started/#4-login-using-the-cli)
            EOT -> (known after apply)
          ~ revision       = 40 -> (known after apply)
          ~ values         = jsonencode(
                {
                  - applicationSet = {
                      - metrics = {
                          - enabled        = true
                          - serviceMonitor = {
                              - additionalLabels = {
                                  - release = "prometheus"
                                }
                              - enabled          = true
                              - selector         = {
                                  - release = "prometheus"
                                }
                            }
                        }
                    }
                  - configs        = {
                      - cm     = {
                          - "accounts.app_user"         = "apiKey"
                          - "accounts.app_user.enabled" = true
                          - "dex.config"                = <<-EOT
                                "connectors":
                                - "config":
                                    "clientID": "5dd3e953-5c5d-4854-b284-a9f1fd0d00fa"
                                    "clientSecret": "${dex.azure.clientSecret}"
                                    "redirectURI": "https://argocd.stinkyboi.com/api/dex/callback"
                                    "tenant": "2aee152b-5281-40d0-8f4b-60faf40514ab"
                                  "id": "microsoft"
                                  "name": "Azure"
                                  "type": "microsoft"
                            EOT
                        }
                      - params = {
                          - "server.insecure" = "true"
                        }
                      - rbac   = {
                          - create           = true
                          - "policy.csv"     = <<-EOT
                                p, app_user, *, *, *, allow
                            EOT
                          - "policy.default" = "role:admin"
                        }
                      - secret = {
                          - createSecret = true
                        }
                    }
                  - controller     = {
                      - metrics = {
                          - enabled        = true
                          - serviceMonitor = {
                              - additionalLabels = {
                                  - release = "prometheus"
                                }
                              - enabled          = true
                              - selector         = {
                                  - release = "prometheus"
                                }
                            }
                        }
                    }
                  - global         = {
                      - addPrometheusAnnotations = "false"
                      - domain                   = "argocd.stinkyboi.com"
                      - env                      = [
                          - {
                              - name      = "dex.azure.clientSecret"
                              - valueFrom = {
                                  - secretKeyRef = {
                                      - key  = "client_secret"
                                      - name = "dex-oidc-secret"
                                    }
                                }
                            },
                        ]
                    }
                  - image          = {
                      - pullPolicy = "Always"
                    }
                  - notifications  = {
                      - metrics = {
                          - enabled        = true
                          - serviceMonitor = {
                              - additionalLabels = {
                                  - release = "prometheus"
                                }
                              - enabled          = true
                              - selector         = {
                                  - release = "prometheus"
                                }
                            }
                        }
                    }
                  - repoServer     = {
                      - metrics = {
                          - enabled        = true
                          - serviceMonitor = {
                              - additionalLabels = {
                                  - release = "prometheus"
                                }
                              - enabled          = true
                              - selector         = {
                                  - release = "prometheus"
                                }
                            }
                        }
                    }
                  - server         = {
                      - certificate = {
                          - enabled    = true
                          - issuer     = {
                              - group = "cert-manager.io"
                              - kind  = "ClusterIssuer"
                              - name  = "cloudflare-clusterissuer"
                            }
                          - secretName = "argocd-server-tls"
                        }
                      - ingress     = {
                          - annotations      = {
                              - "traefik.ingress.kubernetes.io/router.entrypoints" = "websecure"
                            }
                          - enabled          = true
                          - ingressClassName = "traefik"
                          - tls              = true
                        }
                      - metrics     = {
                          - enabled        = true
                          - serviceMonitor = {
                              - additionalLabels = {
                                  - release = "prometheus"
                                }
                              - enabled          = true
                              - selector         = {
                                  - release = "prometheus"
                                }
                            }
                        }
                    }
                }
            ) -> (known after apply)
          ~ version        = "9.3.5" -> (known after apply)
        } -> (known after apply)
        name                       = "argocd"
      ~ set_wo                     = (write-only attribute)
      ~ version                    = "9.3.5" -> "9.4.1"
        # (28 unchanged attributes hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.

Initializing the backend...

Initializing the backend...

Initializing the backend...

Initializing the backend...

Initializing the backend...

Initializing the backend...

Initializing the backend...

Initializing the backend...

Initializing the backend...

Initializing the backend...

Initializing the backend...

Initializing the backend...

Initializing the backend...

Initializing the backend...

Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Reusing previous version of hashicorp/aws from the dependency lock file

Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Reusing previous version of hashicorp/aws from the dependency lock file

Initializing provider plugins...
- Reusing previous version of argoproj-labs/argocd from the dependency lock file

Initializing provider plugins...
- Reusing previous version of argoproj-labs/argocd from the dependency lock file

Initializing provider plugins...
- Reusing previous version of hashicorp/kubernetes from the dependency lock file

Initializing provider plugins...
- Reusing previous version of hashicorp/kubernetes from the dependency lock file

Initializing provider plugins...
- Reusing previous version of argoproj-labs/argocd from the dependency lock file

Initializing provider plugins...
- Reusing previous version of argoproj-labs/argocd from the dependency lock file

Initializing provider plugins...
- Reusing previous version of hashicorp/aws from the dependency lock file

Initializing provider plugins...
- Reusing previous version of hashicorp/kubernetes from the dependency lock file
- Reusing previous version of hashicorp/kubernetes from the dependency lock file
- Reusing previous version of hashicorp/aws from the dependency lock file
- Reusing previous version of argoproj-labs/argocd from the dependency lock file

Initializing provider plugins...
- Reusing previous version of hashicorp/aws from the dependency lock file
- Reusing previous version of hashicorp/kubernetes from the dependency lock file
- Reusing previous version of hashicorp/aws from the dependency lock file
- Reusing previous version of hashicorp/kubernetes from the dependency lock file

Initializing provider plugins...
- Reusing previous version of hashicorp/aws from the dependency lock file

Initializing provider plugins...
- Reusing previous version of argoproj-labs/argocd from the dependency lock file
- Reusing previous version of hashicorp/aws from the dependency lock file
- Reusing previous version of argoproj-labs/argocd from the dependency lock file
- Reusing previous version of argoproj-labs/argocd from the dependency lock file
- Reusing previous version of hashicorp/kubernetes from the dependency lock file

Initializing provider plugins...
- Reusing previous version of hashicorp/aws from the dependency lock file
- Reusing previous version of hashicorp/kubernetes from the dependency lock file
- Reusing previous version of hashicorp/aws from the dependency lock file
- Reusing previous version of argoproj-labs/argocd from the dependency lock file
- Reusing previous version of hashicorp/aws from the dependency lock file
- Reusing previous version of hashicorp/aws from the dependency lock file
- Reusing previous version of hashicorp/aws from the dependency lock file
- Reusing previous version of hashicorp/kubernetes from the dependency lock file
- Reusing previous version of hashicorp/kubernetes from the dependency lock file
- Reusing previous version of hashicorp/kubernetes from the dependency lock file
- Reusing previous version of argoproj-labs/argocd from the dependency lock file
- Reusing previous version of hashicorp/aws from the dependency lock file
- Reusing previous version of argoproj-labs/argocd from the dependency lock file
- Reusing previous version of hashicorp/kubernetes from the dependency lock file
- Reusing previous version of argoproj-labs/argocd from the dependency lock file
- Reusing previous version of hashicorp/kubernetes from the dependency lock file
- Reusing previous version of argoproj-labs/argocd from the dependency lock file
- Reusing previous version of argoproj-labs/argocd from the dependency lock file
- Reusing previous version of hashicorp/kubernetes from the dependency lock file
- Installing hashicorp/kubernetes v3.0.1 to the shared cache directory...
- Installing hashicorp/kubernetes v3.0.1 to the shared cache directory...
- Installing hashicorp/kubernetes v3.0.1 to the shared cache directory...
- Installing argoproj-labs/argocd v7.12.5 to the shared cache directory...
- Installing argoproj-labs/argocd v7.12.5 to the shared cache directory...
- Installing argoproj-labs/argocd v7.12.5 to the shared cache directory...
- Installing argoproj-labs/argocd v7.12.5 to the shared cache directory...
- Installing argoproj-labs/argocd v7.12.5 to the shared cache directory...
- Installing hashicorp/kubernetes v3.0.1 to the shared cache directory...
- Installing hashicorp/aws v6.27.0 to the shared cache directory...
- Installing hashicorp/aws v6.27.0 to the shared cache directory...
- Installing hashicorp/aws v6.27.0 to the shared cache directory...
- Installing hashicorp/aws v6.27.0 to the shared cache directory...
- Installing hashicorp/aws v6.27.0 to the shared cache directory...
- Installed hashicorp/kubernetes v3.0.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/kubernetes v3.0.1 from the shared cache directory
- Installing argoproj-labs/argocd v7.12.5 to the shared cache directory...
- Installed argoproj-labs/argocd v7.12.5. Signature validation was skipped due to the registry not containing GPG keys for this provider
- Using argoproj-labs/argocd v7.12.5 from the shared cache directory
- Installing hashicorp/kubernetes v3.0.1 to the shared cache directory...
- Installed hashicorp/kubernetes v3.0.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/kubernetes v3.0.1 from the shared cache directory
- Installing hashicorp/aws v6.27.0 to the shared cache directory...
- Installed hashicorp/kubernetes v3.0.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/kubernetes v3.0.1 from the shared cache directory
- Installing hashicorp/aws v6.27.0 to the shared cache directory...
- Installed argoproj-labs/argocd v7.12.5. Signature validation was skipped due to the registry not containing GPG keys for this provider
- Using argoproj-labs/argocd v7.12.5 from the shared cache directory
- Waiting for lock on cache directory /home/runner/.cache/terragrunt/providers
- Waiting for lock on cache directory /home/runner/.cache/terragrunt/providers
- Installed hashicorp/kubernetes v3.0.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/kubernetes v3.0.1 from the shared cache directory
- Installing argoproj-labs/argocd v7.12.5 to the shared cache directory...
- Installing hashicorp/aws v6.27.0 to the shared cache directory...
- Waiting for lock on cache directory /home/runner/.cache/terragrunt/providers
- Waiting for lock on cache directory /home/runner/.cache/terragrunt/providers
- Waiting for lock on cache directory /home/runner/.cache/terragrunt/providers
- Waiting for lock on cache directory /home/runner/.cache/terragrunt/providers
- Installed hashicorp/kubernetes v3.0.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/kubernetes v3.0.1 from the shared cache directory
- Waiting for lock on cache directory /home/runner/.cache/terragrunt/providers
- Installed argoproj-labs/argocd v7.12.5. Signature validation was skipped due to the registry not containing GPG keys for this provider
- Using argoproj-labs/argocd v7.12.5 from the shared cache directory
- Installing hashicorp/kubernetes v3.0.1 to the shared cache directory...
- Installing hashicorp/aws v6.27.0 to the shared cache directory...
- Installed hashicorp/kubernetes v3.0.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/kubernetes v3.0.1 from the shared cache directory
- Waiting for lock on cache directory /home/runner/.cache/terragrunt/providers
- Installing hashicorp/aws v6.27.0 to the shared cache directory...
- Installed argoproj-labs/argocd v7.12.5. Signature validation was skipped due to the registry not containing GPG keys for this provider
- Using argoproj-labs/argocd v7.12.5 from the shared cache directory
- Waiting for lock on cache directory /home/runner/.cache/terragrunt/providers
- Installing hashicorp/aws v6.27.0 to the shared cache directory...
- Waiting for lock on cache directory /home/runner/.cache/terragrunt/providers
- Waiting for lock on cache directory /home/runner/.cache/terragrunt/providers
- Installed argoproj-labs/argocd v7.12.5. Signature validation was skipped due to the registry not containing GPG keys for this provider
- Using argoproj-labs/argocd v7.12.5 from the shared cache directory
- Installing hashicorp/aws v6.27.0 to the shared cache directory...
- Installed hashicorp/aws v6.27.0 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/aws v6.27.0 from the shared cache directory
- Installing hashicorp/kubernetes v3.0.1 to the shared cache directory...
- Waiting for lock on cache directory /home/runner/.cache/terragrunt/providers
- Installed hashicorp/kubernetes v3.0.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/kubernetes v3.0.1 from the shared cache directory
- Installing argoproj-labs/argocd v7.12.5 to the shared cache directory...
- Installed argoproj-labs/argocd v7.12.5. Signature validation was skipped due to the registry not containing GPG keys for this provider
- Using argoproj-labs/argocd v7.12.5 from the shared cache directory
- Waiting for lock on cache directory /home/runner/.cache/terragrunt/providers
- Installing hashicorp/aws v6.27.0 to the shared cache directory...
- Waiting for lock on cache directory /home/runner/.cache/terragrunt/providers
- Installed argoproj-labs/argocd v7.12.5. Signature validation was skipped due to the registry not containing GPG keys for this provider
- Using argoproj-labs/argocd v7.12.5 from the shared cache directory
- Installing hashicorp/aws v6.27.0 to the shared cache directory...
- Waiting for lock on cache directory /home/runner/.cache/terragrunt/providers
- Installed argoproj-labs/argocd v7.12.5. Signature validation was skipped due to the registry not containing GPG keys for this provider
- Using argoproj-labs/argocd v7.12.5 from the shared cache directory

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

OpenTofu has been successfully initialized!
- Waiting for lock on cache directory /home/runner/.cache/terragrunt/providers
kubernetes_namespace_v1.monitoring: Refreshing state... [id=monitoring]
kubernetes_ingress_v1.umami_tailscale_funnel: Refreshing state... [id=monitoring/umami-tailscale-funnel]
- Waiting for lock on cache directory /home/runner/.cache/terragrunt/providers
data.aws_ssm_parameter.argocd_app_token: Reading...
aws_ssm_parameter.umami["umami_database_url"]: Refreshing state... [id=/homelab/monitoring/umami_database_url]
- Installed hashicorp/aws v6.27.0 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/aws v6.27.0 from the shared cache directory
- Installing hashicorp/kubernetes v3.0.1 to the shared cache directory...
data.aws_ssm_parameter.argocd_app_token: Read complete after 0s [id=/homelab/argocd/argocd_app_token]
- Installed hashicorp/kubernetes v3.0.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/kubernetes v3.0.1 from the shared cache directory
- Installing argoproj-labs/argocd v7.12.5 to the shared cache directory...
- Installed argoproj-labs/argocd v7.12.5. Signature validation was skipped due to the registry not containing GPG keys for this provider
- Using argoproj-labs/argocd v7.12.5 from the shared cache directory

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

OpenTofu has been successfully initialized!
kubernetes_manifest.umami_image_updater: Refreshing state...
kubernetes_manifest.monitoring_certificate: Refreshing state...
kubernetes_manifest.umami_secret: Refreshing state...
argocd_application.prometheus: Refreshing state... [id=prometheus:]
argocd_application.umami: Refreshing state... [id=umami:]
kubernetes_namespace_v1.tailscale: Refreshing state... [id=tailscale]
data.aws_ssm_parameter.argocd_app_token: Reading...
aws_ssm_parameter.oauth_secret["client_id"]: Refreshing state... [id=/homelab/tailscale/client_id]
aws_ssm_parameter.oauth_secret["client_secret"]: Refreshing state... [id=/homelab/tailscale/client_secret]
╷
│ Error: failed to read application prometheus
│ 
│   with argocd_application.prometheus,
│   on main.tf line 12, in resource "argocd_application" "prometheus":
│   12: resource "argocd_application" "prometheus" {
│ 
│ rpc error: code = Unauthenticated desc = invalid session: token has invalid
│ claims: token is expired
╵

Planning failed. OpenTofu encountered an error while generating this plan.

╷
│ Error: failed to read application umami
│ 
│   with argocd_application.umami,
│   on main.tf line 71, in resource "argocd_application" "umami":
│   71: resource "argocd_application" "umami" {
│ 
│ rpc error: code = Unauthenticated desc = invalid session: token has invalid
│ claims: token is expired
╵
data.aws_ssm_parameter.argocd_app_token: Read complete after 0s [id=/homelab/argocd/argocd_app_token]
argocd_application.tailscale: Refreshing state... [id=tailscale:]
- Installed hashicorp/aws v6.27.0 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/aws v6.27.0 from the shared cache directory
- Installing hashicorp/kubernetes v3.0.1 to the shared cache directory...
- Installed hashicorp/kubernetes v3.0.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/kubernetes v3.0.1 from the shared cache directory
- Installing argoproj-labs/argocd v7.12.5 to the shared cache directory...
- Installed argoproj-labs/argocd v7.12.5. Signature validation was skipped due to the registry not containing GPG keys for this provider
- Using argoproj-labs/argocd v7.12.5 from the shared cache directory

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

OpenTofu has been successfully initialized!
kubernetes_manifest.oauth_secret: Refreshing state...

Planning failed. OpenTofu encountered an error while generating this plan.

╷
│ Error: failed to read application tailscale
│ 
│   with argocd_application.tailscale,
│   on main.tf line 12, in resource "argocd_application" "tailscale":
│   12: resource "argocd_application" "tailscale" {
│ 
│ rpc error: code = Unauthenticated desc = invalid session: token has invalid
│ claims: token is expired
╵
kubernetes_namespace_v1.homarr: Refreshing state... [id=homarr]
data.aws_ssm_parameter.argocd_app_token: Reading...
aws_ssm_parameter.db_secret["mysql-password"]: Refreshing state... [id=/homelab/homarr/mysql-password]
aws_ssm_parameter.db_secret["db-encryption-key"]: Refreshing state... [id=/homelab/homarr/db-encryption-key]
aws_ssm_parameter.db_secret["db-url"]: Refreshing state... [id=/homelab/homarr/db-url]
aws_ssm_parameter.db_secret["mysql-root-password"]: Refreshing state... [id=/homelab/homarr/mysql-root-password]
data.aws_ssm_parameter.argocd_app_token: Read complete after 0s [id=/homelab/argocd/argocd_app_token]
- Installed hashicorp/aws v6.27.0 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/aws v6.27.0 from the shared cache directory
- Installing hashicorp/kubernetes v3.0.1 to the shared cache directory...
- Installed hashicorp/kubernetes v3.0.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/kubernetes v3.0.1 from the shared cache directory
- Installing argoproj-labs/argocd v7.12.5 to the shared cache directory...
kubernetes_manifest.homarr_certificate: Refreshing state...
kubernetes_manifest.homarr_image_updater: Refreshing state...
kubernetes_manifest.db_secret: Refreshing state...
argocd_application.homarr: Refreshing state... [id=homarr:]
- Installed argoproj-labs/argocd v7.12.5. Signature validation was skipped due to the registry not containing GPG keys for this provider
- Using argoproj-labs/argocd v7.12.5 from the shared cache directory

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

OpenTofu has been successfully initialized!

Planning failed. OpenTofu encountered an error while generating this plan.

╷
│ Error: failed to read application homarr
│ 
│   with argocd_application.homarr,
│   on main.tf line 7, in resource "argocd_application" "homarr":
│    7: resource "argocd_application" "homarr" {
│ 
│ rpc error: code = Unauthenticated desc = invalid session: token has invalid
│ claims: token is expired
╵
kubernetes_namespace_v1.postgresql: Refreshing state... [id=database]
data.aws_ssm_parameter.argocd_app_token: Reading...
aws_ssm_parameter.postgresql_secret["password"]: Refreshing state... [id=/homelab/database/password]
aws_ssm_parameter.postgresql_secret["postgres-password"]: Refreshing state... [id=/homelab/database/postgres-password]
aws_ssm_parameter.postgresql_secret["replication-password"]: Refreshing state... [id=/homelab/database/replication-password]
data.aws_ssm_parameter.argocd_app_token: Read complete after 1s [id=/homelab/argocd/argocd_app_token]
- Installed hashicorp/aws v6.27.0 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/aws v6.27.0 from the shared cache directory
- Installing hashicorp/kubernetes v3.0.1 to the shared cache directory...
- Installed hashicorp/kubernetes v3.0.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/kubernetes v3.0.1 from the shared cache directory
- Installing argoproj-labs/argocd v7.12.5 to the shared cache directory...
- Installed argoproj-labs/argocd v7.12.5. Signature validation was skipped due to the registry not containing GPG keys for this provider
- Using argoproj-labs/argocd v7.12.5 from the shared cache directory

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

OpenTofu has been successfully initialized!
kubernetes_manifest.postgresql_image_updater: Refreshing state...
kubernetes_manifest.postgresql_secret: Refreshing state...
argocd_application.postgresql: Refreshing state... [id=postgresql:]

Planning failed. OpenTofu encountered an error while generating this plan.

╷
│ Error: failed to read application postgresql
│ 
│   with argocd_application.postgresql,
│   on main.tf line 7, in resource "argocd_application" "postgresql":
│    7: resource "argocd_application" "postgresql" {
│ 
│ rpc error: code = Unauthenticated desc = invalid session: token has invalid
│ claims: token is expired
╵
kubernetes_namespace_v1.cloudflare-tunnel: Refreshing state... [id=cloudflare-tunnel]
data.aws_ssm_parameter.argocd_app_token: Reading...
aws_ssm_parameter.secret["api_token"]: Refreshing state... [id=/homelab/cloudflare-tunnel/api_token]
aws_ssm_parameter.secret["tunnel_name"]: Refreshing state... [id=/homelab/cloudflare-tunnel/tunnel_name]
aws_ssm_parameter.secret["account_id"]: Refreshing state... [id=/homelab/cloudflare-tunnel/account_id]
data.aws_ssm_parameter.argocd_app_token: Read complete after 1s [id=/homelab/argocd/argocd_app_token]
- Installed hashicorp/aws v6.27.0 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/aws v6.27.0 from the shared cache directory
- Installing argoproj-labs/argocd v7.12.5 to the shared cache directory...
- Installed argoproj-labs/argocd v7.12.5. Signature validation was skipped due to the registry not containing GPG keys for this provider
- Using argoproj-labs/argocd v7.12.5 from the shared cache directory

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

OpenTofu has been successfully initialized!
kubernetes_manifest.secret: Refreshing state...
argocd_application.cloudflare-tunnel: Refreshing state... [id=cloudflare-tunnel-ingress-controller:]

Planning failed. OpenTofu encountered an error while generating this plan.

╷
│ Error: failed to read application cloudflare-tunnel-ingress-controller
│ 
│   with argocd_application.cloudflare-tunnel,
│   on main.tf line 7, in resource "argocd_application" "cloudflare-tunnel":
│    7: resource "argocd_application" "cloudflare-tunnel" {
│ 
│ rpc error: code = Unauthenticated desc = invalid session: token has invalid
│ claims: token is expired
╵
kubernetes_namespace_v1.cert_manager: Refreshing state... [id=cert-manager]
data.aws_ssm_parameter.argocd_app_token: Reading...
aws_ssm_parameter.cloudflare_api_key_secret: Refreshing state... [id=/homelab/cert-manager/api_key]
data.aws_ssm_parameter.argocd_app_token: Read complete after 0s [id=/homelab/argocd/argocd_app_token]
argocd_application.cert_manager: Refreshing state... [id=cert-manager:]
- Installed hashicorp/aws v6.27.0 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/aws v6.27.0 from the shared cache directory
- Installing argoproj-labs/argocd v7.12.5 to the shared cache directory...
kubernetes_manifest.cloudflare_api_key_secret: Refreshing state...
kubernetes_manifest.cloudflare_clusterissuer: Refreshing state...

Planning failed. OpenTofu encountered an error while generating this plan.

╷
│ Error: failed to read application cert-manager
│ 
│   with argocd_application.cert_manager,
│   on main.tf line 7, in resource "argocd_application" "cert_manager":
│    7: resource "argocd_application" "cert_manager" {
│ 
│ rpc error: code = Unauthenticated desc = invalid session: token has invalid
│ claims: token is expired
╵
- Installed argoproj-labs/argocd v7.12.5. Signature validation was skipped due to the registry not containing GPG keys for this provider
- Using argoproj-labs/argocd v7.12.5 from the shared cache directory

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

OpenTofu has been successfully initialized!
kubernetes_namespace_v1.technitium: Refreshing state... [id=technitium]
kubernetes_persistent_volume_claim.technitium_config: Refreshing state... [id=technitium/technitium-config-pvc]
data.aws_ssm_parameter.argocd_app_token: Reading...
data.aws_ssm_parameter.argocd_app_token: Read complete after 1s [id=/homelab/argocd/argocd_app_token]
argocd_application.technitium: Refreshing state... [id=technitium:]
- Installed hashicorp/aws v6.27.0 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/aws v6.27.0 from the shared cache directory
- Installing hashicorp/kubernetes v3.0.1 to the shared cache directory...
- Installed hashicorp/kubernetes v3.0.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/kubernetes v3.0.1 from the shared cache directory

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

OpenTofu has been successfully initialized!
kubernetes_manifest.technitium_certificate: Refreshing state...
kubernetes_manifest.technitium_image_updater: Refreshing state...
kubernetes_ingress_v1.traefik: Refreshing state... [id=technitium/technitium]

Planning failed. OpenTofu encountered an error while generating this plan.

╷
│ Warning: Deprecated Resource
│ 
│   with kubernetes_persistent_volume_claim.technitium_config,
│   on main.tf line 10, in resource "kubernetes_persistent_volume_claim" "technitium_config":
│   10: resource "kubernetes_persistent_volume_claim" "technitium_config" {
│ 
│ Deprecated; use kubernetes_persistent_volume_claim_v1.
│ 
│ (and one more similar warning elsewhere)
╵
╷
│ Error: failed to read application technitium
│ 
│   with argocd_application.technitium,
│   on main.tf line 27, in resource "argocd_application" "technitium":
│   27: resource "argocd_application" "technitium" {
│ 
│ rpc error: code = Unauthenticated desc = invalid session: token has invalid
│ claims: token is expired
╵
kubernetes_namespace_v1.descheduler: Refreshing state... [id=descheduler]
data.aws_ssm_parameter.argocd_app_token: Reading...
data.aws_ssm_parameter.argocd_app_token: Read complete after 1s [id=/homelab/argocd/argocd_app_token]
argocd_application.descheduler: Refreshing state... [id=descheduler:]

Planning failed. OpenTofu encountered an error while generating this plan.

╷
│ Error: failed to read application descheduler
│ 
│   with argocd_application.descheduler,
│   on main.tf line 7, in resource "argocd_application" "descheduler":
│    7: resource "argocd_application" "descheduler" {
│ 
│ rpc error: code = Unauthenticated desc = invalid session: token has invalid
│ claims: token is expired
╵
- Installed hashicorp/aws v6.27.0 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/aws v6.27.0 from the shared cache directory

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

OpenTofu has been successfully initialized!
kubernetes_namespace_v1.n8n: Refreshing state... [id=n8n]
kubernetes_ingress_v1.n8n_tailscale_funnel: Refreshing state... [id=n8n/n8n-tailscale-funnel]
data.aws_ssm_parameter.argocd_app_token: Reading...
data.aws_ssm_parameter.argocd_app_token: Read complete after 1s [id=/homelab/argocd/argocd_app_token]
kubernetes_manifest.n8n_tls: Refreshing state...
kubernetes_manifest.n8n_image_updater: Refreshing state...
argocd_application.n8n: Refreshing state... [id=n8n:]
- Installed hashicorp/aws v6.27.0 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/aws v6.27.0 from the shared cache directory

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

OpenTofu has been successfully initialized!

Planning failed. OpenTofu encountered an error while generating this plan.

╷
│ Error: failed to read application n8n
│ 
│   with argocd_application.n8n,
│   on main.tf line 7, in resource "argocd_application" "n8n":
│    7: resource "argocd_application" "n8n" {
│ 
│ rpc error: code = Unauthenticated desc = invalid session: token has invalid
│ claims: token is expired
╵
kubernetes_namespace_v1.octobot: Refreshing state... [id=octobot]
data.aws_ssm_parameter.argocd_app_token: Reading...
data.aws_ssm_parameter.argocd_app_token: Read complete after 1s [id=/homelab/argocd/argocd_app_token]
kubernetes_manifest.octobot_tls: Refreshing state...
kubernetes_manifest.octobot_image_updater: Refreshing state...
argocd_application.octobot: Refreshing state... [id=octobot:]
- Installed hashicorp/aws v6.27.0 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/aws v6.27.0 from the shared cache directory
- Installing hashicorp/kubernetes v3.0.1 to the shared cache directory...

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  - destroy

OpenTofu planned the following actions, but then encountered a problem:

  # kubernetes_manifest.octobot_image_updater will be destroyed
  # (because kubernetes_manifest.octobot_image_updater is not in configuration)
  - resource "kubernetes_manifest" "octobot_image_updater" {
      - manifest = {
          - apiVersion = "argocd-image-updater.argoproj.io/v1alpha1"
          - kind       = "ImageUpdater"
          - metadata   = {
              - name      = "octobot-image-updater"
              - namespace = "octobot"
            }
          - spec       = {
              - applicationRefs = [
                  - {
                      - images      = [
                          - {
                              - alias                = "octobot"
                              - commonUpdateSettings = {
                                  - updateStrategy = "semver"
                                }
                              - imageName            = "drakkarsoftware/octobot:2.x"
                            },
                        ]
                      - namePattern = "octobot"
                    },
                ]
              - namespace       = "argocd"
            }
        } -> null
      - object   = {
          - apiVersion = "argocd-image-updater.argoproj.io/v1alpha1"
          - kind       = "ImageUpdater"
          - metadata   = {
              - annotations                = null
              - creationTimestamp          = null
              - deletionGracePeriodSeconds = null
              - deletionTimestamp          = null
              - finalizers                 = [
                  - "resources-finalizer.argocd-image-updater.argoproj.io",
                ]
              - generateName               = null
              - generation                 = null
              - labels                     = null
              - managedFields              = null
              - name                       = "octobot-image-updater"
              - namespace                  = "octobot"
              - ownerReferences            = null
              - resourceVersion            = null
              - selfLink                   = null
              - uid                        = null
            }
          - spec       = {
              - applicationRefs      = [
                  - {
                      - commonUpdateSettings = {
                          - allowTags      = null
                          - forceUpdate    = null
                          - ignoreTags     = null
                          - platforms      = null
                          - pullSecret     = null
                          - updateStrategy = null
                        }
                      - images               = [
                          - {
                              - alias                = "octobot"
                              - commonUpdateSettings = {
                                  - allowTags      = null
                                  - forceUpdate    = false
                                  - ignoreTags     = null
                                  - platforms      = null
                                  - pullSecret     = null
                                  - updateStrategy = "semver"
                                }
                              - imageName            = "drakkarsoftware/octobot:2.x"
                              - manifestTargets      = {
                                  - helm      = {
                                      - name = null
                                      - spec = null
                                      - tag  = null
                                    }
                                  - kustomize = {
                                      - name = null
                                    }
                                }
                            },
                        ]
                      - labelSelectors       = {
                          - matchExpressions = null
                          - matchLabels      = null
                        }
                      - namePattern          = "octobot"
                      - writeBackConfig      = {
                          - gitConfig = {
                              - branch          = null
                              - repository      = null
                              - writeBackTarget = null
                            }
                          - method    = null
                        }
                    },
                ]
              - commonUpdateSettings = {
                  - allowTags      = null
                  - forceUpdate    = null
                  - ignoreTags     = null
                  - platforms      = null
                  - pullSecret     = null
                  - updateStrategy = null
                }
              - namespace            = "argocd"
              - writeBackConfig      = {
                  - gitConfig = {
                      - branch          = null
                      - repository      = null
                      - writeBackTarget = null
                    }
                  - method    = null
                }
            }
        } -> null
    }

Plan: 0 to add, 0 to change, 1 to destroy.
╷
│ Error: failed to read application octobot
│ 
│   with argocd_application.octobot,
│   on main.tf line 7, in resource "argocd_application" "octobot":
│    7: resource "argocd_application" "octobot" {
│ 
│ rpc error: code = Unauthenticated desc = invalid session: token has invalid
│ claims: token is expired
╵
- Installed hashicorp/kubernetes v3.0.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/kubernetes v3.0.1 from the shared cache directory

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

OpenTofu has been successfully initialized!
kubernetes_namespace_v1.litellm: Refreshing state... [id=litellm]
aws_ssm_parameter.litellm["username"]: Refreshing state... [id=/homelab/litellm/database/username]
aws_ssm_parameter.litellm_env["AWS_SECRET_ACCESS_KEY"]: Refreshing state... [id=/homelab/litellm/env/AWS_SECRET_ACCESS_KEY]
aws_ssm_parameter.litellm["password"]: Refreshing state... [id=/homelab/litellm/database/password]
data.aws_ssm_parameter.argocd_app_token: Reading...
aws_ssm_parameter.litellm_env["AWS_ACCESS_KEY_ID"]: Refreshing state... [id=/homelab/litellm/env/AWS_ACCESS_KEY_ID]
aws_ssm_parameter.litellm_env["AWS_REGION_NAME"]: Refreshing state... [id=/homelab/litellm/env/AWS_REGION_NAME]
aws_ssm_parameter.litellm_env["OPENAI_API_KEY"]: Refreshing state... [id=/homelab/litellm/env/OPENAI_API_KEY]
data.aws_ssm_parameter.argocd_app_token: Read complete after 0s [id=/homelab/argocd/argocd_app_token]
argocd_application.litellm: Refreshing state... [id=litellm:]
- Installed hashicorp/aws v6.27.0 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/aws v6.27.0 from the shared cache directory
- Installing hashicorp/kubernetes v3.0.1 to the shared cache directory...
kubernetes_manifest.litellm_tls: Refreshing state...
kubernetes_manifest.litellm_image_updater: Refreshing state...
kubernetes_manifest.litellm_env_secret: Refreshing state...
kubernetes_manifest.litellm_secret: Refreshing state...
- Installed hashicorp/kubernetes v3.0.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/kubernetes v3.0.1 from the shared cache directory

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

OpenTofu has been successfully initialized!

Planning failed. OpenTofu encountered an error while generating this plan.

╷
│ Error: failed to read application litellm
│ 
│   with argocd_application.litellm,
│   on main.tf line 7, in resource "argocd_application" "litellm":
│    7: resource "argocd_application" "litellm" {
│ 
│ rpc error: code = Unauthenticated desc = invalid session: token has invalid
│ claims: token is expired
╵
kubernetes_namespace_v1.minecraft: Refreshing state... [id=minecraft]
data.aws_ssm_parameter.argocd_app_token: Reading...
data.aws_ssm_parameter.argocd_app_token: Read complete after 0s [id=/homelab/argocd/argocd_app_token]
argocd_application.minecraft: Refreshing state... [id=minecraft:]
- Installed hashicorp/aws v6.27.0 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/aws v6.27.0 from the shared cache directory

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

OpenTofu has been successfully initialized!
kubernetes_manifest.minecraft_image_updater: Refreshing state...

Planning failed. OpenTofu encountered an error while generating this plan.

╷
│ Error: failed to read application minecraft
│ 
│   with argocd_application.minecraft,
│   on main.tf line 7, in resource "argocd_application" "minecraft":
│    7: resource "argocd_application" "minecraft" {
│ 
│ rpc error: code = Unauthenticated desc = invalid session: token has invalid
│ claims: token is expired
╵
kubernetes_namespace_v1.open_webui: Refreshing state... [id=open-webui]
kubernetes_ingress_v1.traefik: Refreshing state... [id=open-webui/open-webui-ingress]
kubernetes_ingress_v1.mcpo: Refreshing state... [id=open-webui/open-webui-mcpo-ingress]
data.aws_ssm_parameter.argocd_app_token: Reading...
aws_ssm_parameter.open_webui["openai_api_key"]: Refreshing state... [id=/homelab/open-webui/openai_api_key]
data.aws_ssm_parameter.argocd_app_token: Read complete after 0s [id=/homelab/argocd/argocd_app_token]
kubernetes_manifest.open_webui_secret: Refreshing state...
kubernetes_manifest.open_webui_image_updater: Refreshing state...
argocd_application.open_webui: Refreshing state... [id=open-webui:]
- Installed hashicorp/aws v6.27.0 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/aws v6.27.0 from the shared cache directory

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

OpenTofu has been successfully initialized!

Planning failed. OpenTofu encountered an error while generating this plan.

╷
│ Error: failed to read application open-webui
│ 
│   with argocd_application.open_webui,
│   on main.tf line 7, in resource "argocd_application" "open_webui":
│    7: resource "argocd_application" "open_webui" {
│ 
│ rpc error: code = Unauthenticated desc = invalid session: token has invalid
│ claims: token is expired
╵
kubernetes_namespace_v1.homeassistant: Refreshing state... [id=homeassistant]
data.aws_ssm_parameter.argocd_app_token: Reading...
data.aws_ssm_parameter.argocd_app_token: Read complete after 0s [id=/homelab/argocd/argocd_app_token]
kubernetes_manifest.certificate: Refreshing state...
kubernetes_manifest.homeassistant_image_updater: Refreshing state...
argocd_application.homeassistant: Refreshing state... [id=homeassistant:]

Planning failed. OpenTofu encountered an error while generating this plan.

╷
│ Error: failed to read application homeassistant
│ 
│   with argocd_application.homeassistant,
│   on main.tf line 7, in resource "argocd_application" "homeassistant":
│    7: resource "argocd_application" "homeassistant" {
│ 
│ rpc error: code = Unauthenticated desc = invalid session: token has invalid
│ claims: token is expired
╵

❯❯ Run Summary  21 units  3m
   ────────────────────────────
   Succeeded (7)
      argocd ............ 50s
      external-secrets .. 16s
      metallb ........... 15s
      traefik ........... 10s
      metrics ........... 7s
      storage ........... 7s
      longhorn .......... 6s
   Failed (14)
      descheduler ....... 2m
      octobot ........... 2m
      n8n ............... 2m
      open-webui ........ 2m
      minecraft ......... 2m
      cert-manager ...... 2m
      litellm ........... 2m
      monitoring ........ 2m
      database .......... 2m
      homarr ............ 2m
      homeassistant ..... 2m
      cloudflare-tunnel . 2m
      technitium ........ 2m
      tailscale ......... 2m
```

</details>
    
